In [3]:
# 주피터 노트북 구버전
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:97% !important;}
div.CodeMirror {font-family:Consolas; font-size:22pt;}
div.output {font-size:22pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:22pt;}
div.prompt {min-width:70px;}
</style>
"""))

In [3]:
# 주피터 노트북 새버전
from IPython.display import display, HTML
display(HTML("""
<style>
div.jp-WindowedPanel-outer.lm-Widget{padding:5px;}
div.lm-Widget{font-size:19pt;}
div.cm-content {font-family:Consolas; font-size:19pt;}
div.jp-OutputArea-output pre {font-size:19pt; font-weight:bold;}
input.jp-Stdin-input {font-family:Consolas; font-size:19pt;}
td,th{font-size:15pt;}
</style>
"""))

<font size="8" color="red"><b>ch10. Pandas (데이터프레임, 시리즈)</b></font>
- pip install pandas (cmd창에서 실행)

# 1절. 판다스 패키지
- 데이터 분석을 위한 반드시 알아야 할 패키지. 넘파이를 기반으로 하며, 다른 라이브러리와 잘 통합되어 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임을 제공
- 결측치처리, 크기변경(열삭제/추가, 행삭제/추가), 데이터정렬, 데이터분할/병합, 통계처리, 부분데이터추출, 파일입출력, 레이블링, 시각화용이, ....

In [5]:
import pandas as pd
pd.__version__

'2.1.4'

In [6]:
data = pd.read_json('data/ch10_member1.json', encoding="CP949") # 디폴트가 UTF-8
print(type(data))
data

<class 'pandas.core.frame.DataFrame'>

  name  age          email address
0  홍길동   20  hong@hong.com      서울
1  김김김   25   kim@hong.com      경기
2  박길동   30  park@hong.com      제주

In [9]:
data = pd.read_json('data/ch10_member2.json') # UTF-8로 read
data

  name  age          email address
0  홍길동   20  hong@hong.com      서울
1  김김김   25   kim@hong.com      경기
2  박길동   30  park@hong.com      제주

In [10]:
member1 = pd.read_csv('data/ch09_member1.csv', header=None,
                     names=['name','age','email','address'],
                     encoding="utf-8") # encoding="utf-8" 기본값이라 생략가능
member1

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

# 2절. 데이터프레임 만들기
## 2.1 딕션너리를 이용해서 데이터프레임 만들기

In [12]:
d = {'name':['홍길동','신길동'], 'age':[20,30]}
df = pd.DataFrame(data=d)
df

  name  age
0  홍길동   20
1  신길동   30

## 2.2 리스트를 이용하여 데이터 프레임 만들기

In [13]:
d = [{'name':'홍길동', 'age':20} ,  {'name':'신길동', 'age':30}]
df = pd.DataFrame(data=d)
df

  name  age
0  홍길동   20
1  신길동   30

## 2.3 read_csv()

In [16]:
df = pd.read_csv('data/전국 평균 평당 분양가격(2013년 9월부터 2015년 8월까지).csv',
                encoding="CP949")
df.shape # 행, 열

(17, 22)

In [18]:
df.head(2) # 상위2줄

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581

In [19]:
pd.options.display.max_columns # 최대 데이터프레임의 표현될 수 있는 열 수

20

In [20]:
pd.options.display.max_columns = 22
df.sample()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,2014년9월,2014년10월,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,6719,6581,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580

## 2.4 sklearn, statsmodels, searborn 등의 라이브러리에서 데이터프레임 불러오기

In [23]:
import statsmodels.api as sm
iris = sm.datasets.get_rdataset("iris", package="datasets").data
iris.tail() # 끝 5행

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

# 3절. 이름(열, 행) 지정하기

In [25]:
member_df = pd.read_csv('data/ch09_member1.csv', header=None)
member_df

     0   1              2        3
0  홍길동  20  hong@hong.com  서울시 강동구
1  박길서  33  park@hong.com  서울시 강서구
2  박길남  23   gil@hong.com  서울시 강남구
3  김길북  20   kim@hong.com  서울시 강북구
4  신길서  40  park@hong.com  서울시 강서구
5  신길동  28  park@hong.com  서울시 강서동

In [27]:
# 열이름 지정하기
member_df.columns = ['name','age','email','address']
member_df

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [28]:
member_df = pd.concat([member_df, member_df])
member_df

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  서울시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [29]:
member_df.index

Index([0, 1, 2, 3, 4, 5, 0, 1, 2, 3, 4, 5], dtype='int64')

In [31]:
member_df.index = ['동','서','남','북','중','신']*2
member_df

  name  age          email  address
동  홍길동   20  hong@hong.com  서울시 강동구
서  박길서   33  park@hong.com  서울시 강서구
남  박길남   23   gil@hong.com  서울시 강남구
북  김길북   20   kim@hong.com  서울시 강북구
중  신길서   40  park@hong.com  서울시 강서구
신  신길동   28  park@hong.com  서울시 강서동
동  홍길동   20  hong@hong.com  서울시 강동구
서  박길서   33  park@hong.com  서울시 강서구
남  박길남   23   gil@hong.com  서울시 강남구
북  김길북   20   kim@hong.com  서울시 강북구
중  신길서   40  park@hong.com  서울시 강서구
신  신길동   28  park@hong.com  서울시 강서동

In [32]:
member_df.index = range(len(member_df))
member_df

   name  age          email  address
0   홍길동   20  hong@hong.com  서울시 강동구
1   박길서   33  park@hong.com  서울시 강서구
2   박길남   23   gil@hong.com  서울시 강남구
3   김길북   20   kim@hong.com  서울시 강북구
4   신길서   40  park@hong.com  서울시 강서구
5   신길동   28  park@hong.com  서울시 강서동
6   홍길동   20  hong@hong.com  서울시 강동구
7   박길서   33  park@hong.com  서울시 강서구
8   박길남   23   gil@hong.com  서울시 강남구
9   김길북   20   kim@hong.com  서울시 강북구
10  신길서   40  park@hong.com  서울시 강서구
11  신길동   28  park@hong.com  서울시 강서동

In [36]:
# name을 행이름
# memer_df = member_df.set_index("name") #  inplace=False 적용된 내용 return
member_df.set_index("name", inplace=True) #  inplace=True 데이터프레임에 적용
member_df

      age          email  address
name
홍길동    20  hong@hong.com  서울시 강동구
박길서    33  park@hong.com  서울시 강서구
박길남    23   gil@hong.com  서울시 강남구
김길북    20   kim@hong.com  서울시 강북구
신길서    40  park@hong.com  서울시 강서구
신길동    28  park@hong.com  서울시 강서동
홍길동    20  hong@hong.com  서울시 강동구
박길서    33  park@hong.com  서울시 강서구
박길남    23   gil@hong.com  서울시 강남구
김길북    20   kim@hong.com  서울시 강북구
신길서    40  park@hong.com  서울시 강서구
신길동    28  park@hong.com  서울시 강서동

In [41]:
# 행이름을 컬럼에 편입시키디
# member_df = member_df.reset_index() # reset 적용한 것을 return
member_df.reset_index(inplace=True)   # reset을 member_df에 적용
member_df

    level_0  index name  age          email  address
0         0      0  홍길동   20  hong@hong.com  서울시 강동구
1         1      1  박길서   33  park@hong.com  서울시 강서구
2         2      2  박길남   23   gil@hong.com  서울시 강남구
3         3      3  김길북   20   kim@hong.com  서울시 강북구
4         4      4  신길서   40  park@hong.com  서울시 강서구
5         5      5  신길동   28  park@hong.com  서울시 강서동
6         6      6  홍길동   20  hong@hong.com  서울시 강동구
7         7      7  박길서   33  park@hong.com  서울시 강서구
8         8      8  박길남   23   gil@hong.com  서울시 강남구
9         9      9  김길북   20   kim@hong.com  서울시 강북구
10       10     10  신길서   40  park@hong.com  서울시 강서구
11       11     11  신길동   28  park@hong.com  서울시 강서동

In [43]:
name = member_df['name'] # 시리즈
print(type(name))
name

<class 'pandas.core.series.Series'>

0     홍길동
1     박길서
2     박길남
3     김길북
4     신길서
5     신길동
6     홍길동
7     박길서
8     박길남
9     김길북
10    신길서
11    신길동
Name: name, dtype: object

In [46]:
member = member_df.loc[0] # 0번 인덱스 행 => 시리즈
print(type(member))
member

<class 'pandas.core.series.Series'>

level_0                0
index                  0
name                 홍길동
age                   20
email      hong@hong.com
address          서울시 강동구
Name: 0, dtype: object

In [47]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  12 non-null     int64
 1   index    12 non-null     int64
 2   name     12 non-null     object
 3   age      12 non-null     int64
 4   email    12 non-null     object
 5   address  12 non-null     object
dtypes: int64(3), object(3)
memory usage: 708.0+ bytes

In [50]:
member_df['age'] = member_df['age'].astype('float64') # 데이터 프레임의 열의 타입을 변경

In [51]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  12 non-null     int64
 1   index    12 non-null     int64
 2   name     12 non-null     object
 3   age      12 non-null     float64
 4   email    12 non-null     object
 5   address  12 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 708.0+ bytes

# 4절. 부분 데이터 조회
- 특정열, 특정행, 특정행의 특정열, 특정조건의 행 모든열, 특정조건의 행의 특정열

In [5]:
import pandas as pd
member = pd.read_csv('data/ch09_member2.csv')
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

## 4.1 단일열 조회

In [7]:
member['name'].to_frame() #시리즈를 데이터 프레임으로

  name
0  홍길동
1  박길서
2  박길남
3  김길북
4  신길서
5  신길동

## 4.2 loc[]을 이용한 이름(열,행)으로 조회
- 단일행, 여러행, 여러열, 행과 열을 동시에 접근
- member.loc[행(행슬라싱), 열(열슬라이싱)]

In [11]:
# 단일행
member.loc[0] # 시리즈

name                 홍길동
age                   20
email      hong@hong.com
address          서울시 강동구
Name: 0, dtype: object

In [12]:
# 여러행
member.loc[0:5] # 0행부터 5행까지

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [16]:
# 여러열( name열부터 email열까지 == age열포함)
member.loc[:, 'name':'email']

  name  age          email
0  홍길동   20  hong@hong.com
1  박길서   33  park@hong.com
2  박길남   23   gil@hong.com
3  김길북   20   kim@hong.com
4  신길서   40  park@hong.com
5  신길동   28  park@hong.com

In [17]:
# 여러열(name열과 email열)
member.loc[:, ['name','email'] ]

  name          email
0  홍길동  hong@hong.com
1  박길서  park@hong.com
2  박길남   gil@hong.com
3  김길북   kim@hong.com
4  신길서  park@hong.com
5  신길동  park@hong.com

In [18]:
# 1행부터 4행까지 name과 email
member.loc[1:4, ['name','email'] ]

  name          email
1  박길서  park@hong.com
2  박길남   gil@hong.com
3  김길북   kim@hong.com
4  신길서  park@hong.com

In [19]:
# 1행과 4행까지 name, email, address 출력
member.loc[ [1,2], ['name','email','address'] ]

  name          email  address
1  박길서  park@hong.com  부산시 강서구
2  박길남   gil@hong.com  서울시 강남구

In [25]:
# 1행~4행까지 name열~ email열 출력
member.loc[ 1:4, 'name':'email'] # loc사용시 index이름과 column이름을 사용

  name  age          email
1  박길서   33  park@hong.com
2  박길남   23   gil@hong.com
3  김길북   20   kim@hong.com
4  신길서   40  park@hong.com

## 4.3 iloc[]을 이용한 숫자(인덱스)로 조회
- 몇번째 행부터 몇번째 행 앞까지, 몇번째 열부터 몇번째 열앞까지 . 음수가능

In [28]:
member.iloc[0:4] # 슬라이싱 from:to:step : from부터 to앞까지 step씩

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구

In [29]:
member.iloc[0, 0:3] # 0열부터 3열 앞까지

name               홍길동
age                 20
email    hong@hong.com
Name: 0, dtype: object

In [32]:
# 맨 오른쪽 열을 제외하고 출력
member.iloc[:, :-1]

  name  age          email
0  홍길동   20  hong@hong.com
1  박길서   33  park@hong.com
2  박길남   23   gil@hong.com
3  김길북   20   kim@hong.com
4  신길서   40  park@hong.com
5  신길동   28  park@hong.com

In [34]:
# 0,2,4,6... 짝수번째 행의 모든 열출력
member.iloc[::2, 0:2]

  name  age
0  홍길동   20
2  박길남   23
4  신길서   40

In [35]:
# member의 행순서를 역순 출력(맨 마지막열을 제외하고)
member.iloc[::-1, :-1]

  name  age          email
5  신길동   28  park@hong.com
4  신길서   40  park@hong.com
3  김길북   20   kim@hong.com
2  박길남   23   gil@hong.com
1  박길서   33  park@hong.com
0  홍길동   20  hong@hong.com

## 4.4 조건으로 조회하기

In [37]:
# 30살 이상의 데이터 출력
member.loc[member['age']>=30] # 인덱스 대신 조건

  name  age          email  address
1  박길서   33  park@hong.com  부산시 강서구
4  신길서   40  park@hong.com  서울시 강서구

In [40]:
address = "서울시 강동구"
address.find('강동구')

4

In [ ]:
# 시리즈에 문자함수를 사용하는 방법
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

In [45]:
member['address'].str.find('강서구')!=-1

0    False
1     True
2    False
3    False
4     True
5    False
Name: address, dtype: bool

In [47]:
# address가 '강서구'인 데이터의 name, age, address를 출력
member.loc[member['address'].str.find('강서구')!=-1, ['name','age','address']   ]

  name  age  address
1  박길서   33  부산시 강서구
4  신길서   40  서울시 강서구

In [48]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   email    6 non-null      object
 3   address  6 non-null      object
dtypes: int64(1), object(3)
memory usage: 324.0+ bytes

In [50]:
# 결측치 확인
member.isna().sum()

name       0
age        0
email      0
address    0
dtype: int64

In [55]:
# iris
import seaborn as sns
iris_df = sns.load_dataset('iris')
# 0~49 setosa / 50~99 sersicolor / 100~149 virginica
iris_df.loc[100:149].head()

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
101           5.8          2.7           5.1          1.9  virginica
102           7.1          3.0           5.9          2.1  virginica
103           6.3          2.9           5.6          1.8  virginica
104           6.5          3.0           5.8          2.2  virginica

In [58]:
# species가 versicolor인 데이터 상위 3개의 모든열
iris_df[iris_df['species']=='versicolor'].head(3)

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor

In [59]:
# species가 versicolor인 데이터의 맨마지막 열을 제외한 데이터
iris_df.loc[iris_df['species']=='versicolor', "sepal_length":"petal_width"].head(3)

    sepal_length  sepal_width  petal_length  petal_width
50           7.0          3.2           4.7          1.4
51           6.4          3.2           4.5          1.5
52           6.9          3.1           4.9          1.5

In [67]:
# species가 versicolor인 데이터의 맨마지막 열을 제외한 데이터
iris_df.iloc[:, :-1][iris_df['species']=='versicolor']

    sepal_length  sepal_width  petal_length  petal_width
50           7.0          3.2           4.7          1.4
51           6.4          3.2           4.5          1.5
52           6.9          3.1           4.9          1.5
53           5.5          2.3           4.0          1.3
54           6.5          2.8           4.6          1.5
55           5.7          2.8           4.5          1.3
56           6.3          3.3           4.7          1.6
57           4.9          2.4           3.3          1.0
58           6.6          2.9           4.6          1.3
59           5.2          2.7           3.9          1.4
60           5.0          2.0           3.5          1.0
61           5.9          3.0           4.2          1.5
62           6.0          2.2           4.0          1.0
63           6.1          2.9           4.7          1.4
64           5.6          2.9           3.6          1.3
65           6.7          3.1           4.4          1.4
66           5.6          3.0           4.5          1.5
67           5.8          2.7           4.1          1.0
68           6.2          2.2           4.5          1.5
69           5.6          2.5           3.9          1.1
70           5.9          3.2           4.8          1.8
71           6.1          2.8           4.0          1.3
72           6.3          2.5           4.9          1.5
73           6.1          2.8           4.7          1.2
74           6.4          2.9           4.3          1.3
75           6.6          3.0           4.4          1.4
76           6.8          2.8           4.8          1.4
77           6.7          3.0           5.0          1.7
78           6.0          2.9           4.5          1.5
79           5.7          2.6           3.5          1.0
80           5.5          2.4           3.8          1.1
81           5.5          2.4           3.7          1.0
82           5.8          2.7           3.9          1.2
83           6.0          2.7           5.1          1.6
84           5.4          3.0           4.5          1.5
85           6.0          3.4           4.5          1.6
86           6.7          3.1           4.7          1.5
87           6.3          2.3           4.4          1.3
88           5.6          3.0           4.1          1.3
89           5.5          2.5           4.0          1.3
90           5.5          2.6           4.4          1.2
91           6.1          3.0           4.6          1.4
92           5.8          2.6           4.0          1.2
93           5.0          2.3           3.3          1.0
94           5.6          2.7           4.2          1.3
95           5.7          3.0           4.2          1.2
96           5.7          2.9           4.2          1.3
97           6.2          2.9           4.3          1.3
98           5.1          2.5           3.0          1.1
99           5.7          2.8           4.1          1.3

In [71]:
# sepal.length가 6.2 보다 크고, species가 versicolor인 데이터를 출력
iris_df[ (iris_df.species == 'versicolor') & (iris_df.sepal_length>6.2)]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
56           6.3          3.3           4.7          1.6  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
72           6.3          2.5           4.9          1.5  versicolor
74           6.4          2.9           4.3          1.3  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor
87           6.3          2.3           4.4          1.3  versicolor

In [73]:
# sepal.length가 6.2 보다 크고, species가 versicolor인 데이터의 sepal_length와 species, sepal_width를 출력
iris_df.loc[ (iris_df.species == 'versicolor') & (iris_df.sepal_length>6.2), 
                        ['sepal_length','sepal_width','species']]

    sepal_length  sepal_width     species
50           7.0          3.2  versicolor
51           6.4          3.2  versicolor
52           6.9          3.1  versicolor
54           6.5          2.8  versicolor
56           6.3          3.3  versicolor
58           6.6          2.9  versicolor
65           6.7          3.1  versicolor
72           6.3          2.5  versicolor
74           6.4          2.9  versicolor
75           6.6          3.0  versicolor
76           6.8          2.8  versicolor
77           6.7          3.0  versicolor
86           6.7          3.1  versicolor
87           6.3          2.3  versicolor

# 5절. 데이터 추가 및 삭제

In [74]:
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [77]:
import numpy as np
member['major'] = ['컴공','전기','전자','기계','AI',np.nan]
member

  name  age          email  address major
0  홍길동   20  hong@hong.com  서울시 강동구    컴공
1  박길서   33  park@hong.com  부산시 강서구    전기
2  박길남   23   gil@hong.com  서울시 강남구    전자
3  김길북   20   kim@hong.com  서울시 강북구    기계
4  신길서   40  park@hong.com  서울시 강서구    AI
5  신길동   28  park@hong.com  서울시 강서동   NaN

In [78]:
hobby = pd.DataFrame( {'hobby':['놀기','자기','읽기','먹기','공부','명상']})
hobby

  hobby
0    놀기
1    자기
2    읽기
3    먹기
4    공부
5    명상

In [82]:
member = pd.concat([member, hobby], axis=1)
member

  name  age          email  address major hobby hobby
0  홍길동   20  hong@hong.com  서울시 강동구    컴공    놀기    놀기
1  박길서   33  park@hong.com  부산시 강서구    전기    자기    자기
2  박길남   23   gil@hong.com  서울시 강남구    전자    읽기    읽기
3  김길북   20   kim@hong.com  서울시 강북구    기계    먹기    먹기
4  신길서   40  park@hong.com  서울시 강서구    AI    공부    공부
5  신길동   28  park@hong.com  서울시 강서동   NaN    명상    명상

In [86]:
# 열삭제
member.drop(['hobby', 'major'], axis=1, inplace=True)
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
4  신길서   40  park@hong.com  서울시 강서구
5  신길동   28  park@hong.com  서울시 강서동

In [88]:
# 행삭제
member.drop(4, inplace=True)
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길서   33  park@hong.com  부산시 강서구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
5  신길동   28  park@hong.com  서울시 강서동

In [89]:
member = member.drop(1)

In [90]:
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
2  박길남   23   gil@hong.com  서울시 강남구
3  김길북   20   kim@hong.com  서울시 강북구
5  신길동   28  park@hong.com  서울시 강서동

In [92]:
member.index = range(len(member))
member

  name  age          email  address
0  홍길동   20  hong@hong.com  서울시 강동구
1  박길남   23   gil@hong.com  서울시 강남구
2  김길북   20   kim@hong.com  서울시 강북구
3  신길동   28  park@hong.com  서울시 강서동

# 6절. 정렬

In [98]:
member = member.sort_index(ascending=True, axis=0) # 인덱스로 정렬
member

   address  age          email name
0  서울시 강동구   20  hong@hong.com  홍길동
1  서울시 강남구   23   gil@hong.com  박길남
2  서울시 강북구   20   kim@hong.com  김길북
3  서울시 강서동   28  park@hong.com  신길동

In [99]:
# 특정열의 값 기준 정렬
member.sort_values(by=['name','age'], inplace=True)
member

   address  age          email name
2  서울시 강북구   20   kim@hong.com  김길북
1  서울시 강남구   23   gil@hong.com  박길남
3  서울시 강서동   28  park@hong.com  신길동
0  서울시 강동구   20  hong@hong.com  홍길동

# 7절. 기초통계 분석
- count : NA(결측치)를 제외한 갯수
- min
- max
- sum
- mean
- std : 표준편차
- var : 분산
- quantile 분위수(1사분위수, 2사분위수, 3사분위수)
- median
- corr : 상관관계

In [104]:
iris_df.iloc[:,:-1].min(axis=1) # 행마다 모든 열의 최소값

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Length: 150, dtype: float64

In [106]:
iris_df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [107]:
iris_df.iloc[:, :-1].mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [108]:
iris_df.iloc[:, :-1].std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [112]:
iris_df.describe() # 수치형데이터의 갯수, 평균, 표준편차, 최소 최대, 사분위수

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [113]:
iris_df['species'].describe() # 범주형 데이터

count        150
unique         3
top       setosa
freq          50
Name: species, dtype: object

In [115]:
iris_df.describe(include='all') # 수치형과 범주형 데이터 모두 describe

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [121]:
iris_df[iris_df['species'].isna()] # species가 결측치인 행을 출력

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

# 8절. 그룹화

In [125]:
iris_df.groupby(['species']).median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [126]:
iris_group = iris_df.groupby(['species'])
iris_group.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

# 연습문제

In [127]:
import seaborn as sns
iris = sns.load_dataset("iris")
iris.sample(1)

    sepal_length  sepal_width  petal_length  petal_width species
35           5.0          3.2           1.2          0.2  setosa

In [141]:
#8. 열들 사이의 상관계수
r = iris.iloc[:,:-1].corr()
r

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000